export const tier4ItemIds = [
  '66130142', // '운명의 파편 주머니(중)'
  '66130141', // '운명의 파편 주머니(소)'
  '6861012', // '아비도스 융화 재료'
  '66102006', // '운명의 파괴석'
  '66110225', // '운명의 돌파석'
  '66102106', // '운명의 수호석'
  '66112543', // '야금술 : 업화 [11-14]'
  '66112546', // '재봉술 : 업화 [11-14]'
  '66111131', // '용암의 숨결'
  '66111132', // '빙하의 숨결'
  '66150010', // 에스더의 기운
  't4_gem10_D_66666666', // '10레벨 겁화의 보석'
  't4_gem10_C_66666666', // '10레벨 작열의 보석'
  't4_gem9_D_66666666', // '9레벨 겁화의 보석'
  't4_gem9_C_66666666', // '9레벨 작열의 보석'
  't4_gem8_D_66666666', // '8레벨 겁화의 보석'
  't4_gem8_C_66666666', // '8레벨 작열의 보석'
  't4_gem7_D_66666666', // '7레벨 겁화의 보석'
  't4_gem7_C_66666666', // '7레벨 작열의 보석'
  't4_gem6_D_66666666', // '6레벨 겁화의 보석'
  't4_gem6_C_66666666', // '6레벨 작열의 보석'
];

export const tier3ItemIds = [
  '66130133', // '명예의 파편 주머니(대)'
  '66130132', // '명예의 파편 주머니(중)'
  '66130131', // '명예의 파편 주머니(소)'
  '66102004', // '파괴강석'
  '66110222', // '위대한 명예의 돌파석'
  '66110221', // '명예의 돌파석'
  '66110223', // '경이로운 명예의 돌파석'
  '6861009', // '상급 오레하 융화 재료'
  '66102005', // '정제된 파괴강석'
  '6861011', // '최상급 오레하 융화 재료'
  '66110224', // '찬란한 명예의 돌파석'
  '66102104', // '수호강석'
  '66102105', // '정제된 수호강석'
  '66111121', // '태양의 은총'
  '66111122', // '태양의 축복'
  '66111123', // '태양의 가호'
  '66112541', // '야금술 : 쇠락 [13-15]'
  '66112542', // '야금술 : 쇠락 [16-19]'
  '66112532', // '야금술 : 몽환 [16-19]'
  '66112544', // '재봉술 : 쇠락 [13-15]'
  '66112535', // '재봉술 : 몽환 [16-19]'
  '66112545', // '재봉술 : 쇠락 [16-19]'
  '66150010', // 에스더의 기운
  'gem10_D_66666666', // '10레벨 멸화의 보석'
  'gem10_C_66666666', // '10레벨 홍염의 보석'
  'gem9_D_66666666', // '9레벨 멸화의 보석'
  'gem9_C_66666666', // '9레벨 홍염의 보석'
  'gem8_D_66666666', // '8레벨 멸화의 보석'
  'gem8_C_66666666', // '8레벨 홍염의 보석'
  'gem7_D_66666666', // '7레벨 멸화의 보석'
  'gem7_C_66666666', // '7레벨 홍염의 보석'
];

export const itemIdNameNameMapping = {
  '66130142': '운명의 파편 주머니(중)',
  '66130141': '운명의 파편 주머니(소)',
  '6861012': '아비도스 융화 재료',
  '66102006': '운명의 파괴석',
  '66110225': '운명의 돌파석',
  '66102106': '운명의 수호석',
  '66112543': '야금술 : 업화 [11-14]',
  '66112546': '재봉술 : 업화 [11-14]',
  '66111131': '용암의 숨결',
  '66111132': '빙하의 숨결',
  '66150010': '에스더의 기운',
  t4_gem10_D_66666666: '10레벨 겁화의 보석',
  t4_gem10_C_66666666: '10레벨 작열의 보석',
  t4_gem9_D_66666666: '9레벨 겁화의 보석',
  t4_gem9_C_66666666: '9레벨 작열의 보석',
  t4_gem8_D_66666666: '8레벨 겁화의 보석',
  t4_gem8_C_66666666: '8레벨 작열의 보석',
  t4_gem7_D_66666666: '7레벨 겁화의 보석',
  t4_gem7_C_66666666: '7레벨 작열의 보석',
  t4_gem6_D_66666666: '6레벨 겁화의 보석',
  t4_gem6_C_66666666: '6레벨 작열의 보석',

  '66130133': '명예의 파편 주머니(대)',
  '66130132': '명예의 파편 주머니(중)',
  '66130131': '명예의 파편 주머니(소)',
  '66102004': '파괴강석',
  '66110222': '위대한 명예의 돌파석',
  '66110221': '명예의 돌파석',
  '66110223': '경이로운 명예의 돌파석',
  '6861009': '상급 오레하 융화 재료',
  '66102005': '정제된 파괴강석',
  '6861011': '최상급 오레하 융화 재료',
  '66110224': '찬란한 명예의 돌파석',
  '66102104': '수호강석',
  '66102105': '정제된 수호강석',
  '66111121': '태양의 은총',
  '66111122': '태양의 축복',
  '66111123': '태양의 가호',
  '66112541': '야금술 : 쇠락 [13-15]',
  '66112542': '야금술 : 쇠락 [16-19]',
  '66112532': '야금술 : 몽환 [16-19]',
  '66112544': '재봉술 : 쇠락 [13-15]',
  '66112535': '재봉술 : 몽환 [16-19]',
  '66112545': '재봉술 : 쇠락 [16-19]',
  gem10_D_66666666: '10레벨 멸화의 보석',
  gem10_C_66666666: '10레벨 홍염의 보석',
  gem9_D_66666666: '9레벨 멸화의 보석',
  gem9_C_66666666: '9레벨 홍염의 보석',
  gem8_D_66666666: '8레벨 멸화의 보석',
  gem8_C_66666666: '8레벨 홍염의 보석',
  gem7_D_66666666: '7레벨 멸화의 보석',
  gem7_C_66666666: '7레벨 홍염의 보석',
};
